<template>
    <header class="vue-design-modal-header">
        <div class="vue-design-modal-logo">
            <svg
                xmlns="http://www.w3.org/2000/svg"
                xmlns:xlink="http://www.w3.org/1999/xlink"
                width="150"
                height="20"
                viewBox="0 0 150 20"
                fill="none"
            >
                <path
                    id="拼合图形"
                    fill-rule="evenodd"
                    style="fill: #3d7eff"
                    transform="translate(0 0)  rotate(0 75 10)"
                    opacity="1"
                    d="M25 -0.01L21.19 -0.01L27.88 15.88L31.26 15.88L38.22 -0.01L34.41 -0.01L29.67 11.95L25 -0.01ZM53.16 12.41C52.9 13.22 52.5 13.86 51.96 14.35C50.7 15.45 48.93 16 46.62 16C44.16 16 42.37 15.46 41.24 14.38C40.66 13.82 40.25 13.2 40.03 12.51C39.81 11.82 39.69 10.85 39.69 9.59L39.69 -0.01L43.05 -0.01L43.05 9.52C43.05 10.28 43.12 10.87 43.24 11.29C43.37 11.71 43.58 12.08 43.89 12.38C44.55 13.03 45.48 13.35 46.67 13.35C47.43 13.35 48.1 13.22 48.66 12.96C49.22 12.7 49.62 12.35 49.84 11.9C50.06 11.46 50.17 10.66 50.17 9.52L50.17 -0.01L53.55 -0.01L53.55 9.35C53.55 10.59 53.42 11.61 53.16 12.41ZM68.53 13.04L64.29 13.04C62.66 13.04 61.5 12.78 60.82 12.25C60.13 11.71 59.73 10.77 59.6 9.4L68.53 9.4L68.53 6.57L59.6 6.57C59.67 5.8 59.74 5.26 59.83 4.95C59.92 4.63 60.08 4.31 60.32 3.99C60.67 3.53 61.1 3.22 61.63 3.06C62.15 2.91 62.98 2.83 64.13 2.83L68.53 2.83L68.53 -0.01L62.84 -0.01C61.73 -0.01 60.85 0.1 60.19 0.3C59.53 0.51 58.9 0.87 58.32 1.4Q55.77 3.71 55.77 7.85C55.77 10.35 56.37 12.32 57.58 13.78C58.42 14.8 59.56 15.43 60.98 15.66C61.89 15.81 62.94 15.88 64.13 15.88L68.53 15.88L68.53 13.04ZM90.58 3.9C90.01 2.25 88.88 1.11 87.18 0.49C86.26 0.16 84.96 -0.01 83.27 -0.01L76.53 -0.01L76.53 15.88L83.27 15.88C84.75 15.88 85.85 15.81 86.57 15.68C87.29 15.54 87.96 15.28 88.56 14.9C89.51 14.28 90.2 13.32 90.61 12.02C91.02 10.75 91.23 9.4 91.23 7.97C91.23 6.53 91.01 5.17 90.58 3.9ZM118.64 -0.01L118.64 3.09L121.83 3.09L121.83 -0.01L118.64 -0.01ZM6.48 0L0 0L0 15.88L6.48 15.88C6.48 15.88 9.14 15.88 11.27 14.94C11.27 14.94 13.39 13.99 14.63 12.19C14.63 12.19 15.88 10.39 15.88 7.91C15.88 7.91 15.88 5.44 14.63 3.65C14.63 3.65 14.43 3.36 14.04 2.94L7.06 14.12L1.76 5.29L5.3 5.29L7.06 8.83L11.67 1.13C11.54 1.06 11.4 0.99 11.26 0.93C11.26 0.93 9.12 0 6.48 0ZM86.13 3.64C86.54 4.02 86.88 4.6 87.13 5.38C87.39 6.15 87.51 7.01 87.51 7.95C87.51 8.79 87.41 9.58 87.19 10.33C86.98 11.08 86.7 11.66 86.35 12.07C85.77 12.72 84.75 13.04 83.27 13.04L79.92 13.04L79.92 2.83L83.27 2.83C84.58 2.83 85.53 3.1 86.13 3.64ZM98.75 6.76C97.88 6.76 97.27 6.9 96.92 7.2C96.57 7.49 96.36 8.03 96.28 8.83L102.99 8.83L102.99 11.31L96.28 11.31C96.34 12.07 96.59 12.61 97.01 12.93C97.44 13.24 98.14 13.4 99.11 13.4L102.99 13.4L102.99 15.88L98.75 15.88C97.83 15.88 97.08 15.8 96.5 15.63C95.92 15.46 95.38 15.19 94.87 14.81C93.46 13.71 92.75 12.08 92.75 9.92C92.75 8.53 93.12 7.3 93.87 6.26C94.38 5.54 94.99 5.03 95.7 4.73C96.42 4.43 97.36 4.28 98.51 4.28L102.99 4.28L102.99 6.76L98.75 6.76ZM111.71 15.88C112.88 15.88 113.72 15.79 114.22 15.62C114.72 15.44 115.14 15.08 115.49 14.52C115.97 13.82 116.21 13.05 116.21 12.21Q116.21 10.545 115.04 9.69C114.34 9.18 113.39 8.92 112.18 8.92L110.3 8.92C109.46 8.92 108.95 8.86 108.75 8.73C108.41 8.51 108.23 8.19 108.23 7.78C108.23 7.29 108.41 6.98 108.78 6.85C108.95 6.79 109.37 6.76 110.02 6.76L115.66 6.76L115.66 4.28L108.85 4.28C107.6 4.28 106.71 4.49 106.21 4.9C105.37 5.58 104.94 6.5 104.94 7.66C104.94 8.27 105.07 8.83 105.31 9.36C105.56 9.9 105.9 10.31 106.33 10.62C106.67 10.87 107.05 11.04 107.46 11.14C107.86 11.23 108.45 11.28 109.21 11.28L111.14 11.28Q112.235 11.28 112.52 11.43C112.9 11.6 113.09 11.93 113.09 12.4C113.09 12.99 112.8 13.31 112.23 13.38C111.98 13.39 111.5 13.4 110.8 13.4L105.11 13.4L105.11 15.88L111.71 15.88ZM118.64 15.88L118.64 4.28L121.83 4.28L121.83 15.88L118.64 15.88ZM132.58 17.2C132.79 16.99 132.9 16.55 132.9 15.88L129.97 15.88C129.04 15.88 128.26 15.78 127.65 15.58C127.04 15.38 126.49 15.05 126 14.59C124.84 13.5 124.26 11.99 124.26 10.07C124.26 7.88 124.96 6.28 126.38 5.28C126.88 4.91 127.42 4.66 127.98 4.51C128.55 4.35 129.27 4.28 130.14 4.28L136.09 4.28L136.09 15.81C136.09 16.46 136.02 17.04 135.87 17.55C135.72 18.05 135.5 18.48 135.21 18.83C134.85 19.28 134.41 19.58 133.89 19.75C133.37 19.92 132.62 20 131.64 20L125.28 20L125.28 17.52L131.21 17.52C131.91 17.52 132.37 17.42 132.58 17.2ZM139.21 15.88L139.21 4.28L145.36 4.28C146.28 4.28 146.98 4.35 147.46 4.48C147.95 4.62 148.39 4.86 148.79 5.21C149.6 5.95 150 7.13 150 8.73L150 15.88L146.81 15.88L146.81 8.38C146.81 7.8 146.68 7.39 146.43 7.14C146.17 6.88 145.75 6.76 145.17 6.76L142.4 6.76L142.4 15.88L139.21 15.88ZM132.9 13.4L130.43 13.4C129.47 13.4 128.75 13.12 128.25 12.56C127.75 11.99 127.5 11.17 127.5 10.09Q127.5 6.76 130.26 6.76L132.9 6.76L132.9 13.4ZM73.68 12.78L70.8 12.78L70.8 15.88L73.68 15.88L73.68 12.78Z"
                />
            </svg>
            <span>专注前端开发者</span>
        </div>
        <div class="vue-design-modal-user">
            <template v-if="state.token && state.user">
                <a-dropdown :trigger="['click']" placement="bottomRight">
                    <a-avatar
                        v-if="state.user"
                        :src="state.user.avatar"
                        size="small"
                    >
                        <template #icon><UserOutlined /></template>
                    </a-avatar>
                    <template #overlay>
                        <a-menu>
                            <a-menu-item key="0">
                                <span class="username">
                                    {{
                                        state.user.username ||
                                        state.user.nickname ||
                                        state.user.phone
                                    }}
                                </span>
                            </a-menu-item>
                            <a-menu-divider />
                            <a-menu-item key="3" @click="handleLogout">
                                退出登录
                            </a-menu-item>
                        </a-menu>
                    </template>
                </a-dropdown>
            </template>
            <template v-else>
                <a-button
                    type="link"
                    v-if="state.view !== 'modal-content'"
                    @click="handleGotoInfo"
                >
                    <template #icon>
                        <arrow-left-outlined />
                    </template>
                </a-button>
                <a-button
                    type="link"
                    :disabled="state.view !== 'modal-content'"
                    @click="handleGotoLogin"
                >
                    登录/注册
                </a-button>
            </template>
        </div>
    </header>
</template>
<script lang="ts">
export default {
    name: 'modal-header',
};
</script>
<script lang="ts" setup>
import { UserOutlined, ArrowLeftOutlined } from '@ant-design/icons-vue';
import { state } from '../uses/useStore';
import useAuth from '../uses/useAuth';
const { handleLogout, handleGotoLogin, handleGotoInfo } = useAuth();
</script>

<style scoped lang="scss">
.vue-design-modal-header {
    background-color: #fff;
    width: 100%;
    display: flex;
    justify-content: space-between;
    align-items: center;
}
.vue-design-modal-user {
    height: 24px;
    width: auto;
    display: flex;
    .ant-btn {
        height: auto;
        padding: 0;
        cursor: pointer;
    }
    > span {
        display: block;
        height: 24px;
        line-height: 24px;

        &.avatar {
            width: 24px;
            border-radius: 50%;
            background-color: #bbb;
            margin-left: 8px;
            background-size: cover;
            background-repeat: no-repeat;
            background-position: center;
        }
    }
}
.vue-design-modal-logo {
    padding-top: 5px;
    > span {
        display: inline-block;
        vertical-align: middle;
        font-size: 13px;
        font-weight: 700;
        padding-top: 2px;
        color: #666;
        margin-left: 5px;
    }
    > svg {
        height: 24px;
        width: auto;
        display: inline-block;
        vertical-align: middle;
    }
}
</style>
